Repository: vijaykuppli/MovieExplorerPOC
Catalog: Localizable.xcstrings
Source language: en
Languages: te

source: Cancel
te: రద్దు

source: Done
te: పూర్తయింది

source: Invalid Credentials
te: చెల్లని ఆధారాలు

# login_title
source: Login
te: లాగిన్

# movies_title
source: Movies
te: సినిమాలు

source: Okay
te: సరే

# password_placeholder
source: Password
te: పాస్‌వర్డ్

# profile_title
source: Profile
te: పాస్‌వర్డ్

# register_title
source: Register
te: నమోదు

source: User not found
te: వినియోగదారు కనుగొనబడలేదు

# username_placeholder
source: Username
te: వినియోగదారు పేరు
